import 'package:flutter/material.dart';

import 'package:shared_preferences/shared_preferences.dart';

class Body extends StatefulWidget {
  final Axis bodyBool;
  String? fontTypes;
  final VoidCallback axisHorizontalDirection;
  final VoidCallback axisVerticalDirection;

  Body({
    super.key,
    required this.bodyBool,
    required this.fontTypes,
    required this.axisVerticalDirection,
    required this.axisHorizontalDirection,
  });
  @override
  State<Body> createState() => _BodyState();
}

class _BodyState extends State<Body> {
  // String? img;
  String? displayFont;

  List<Map<String, dynamic>> mezmureDawit = [
    {
      "id": 1,
      "ምዕራፍ": "ምዕራፍ 1",
      "text": """
1 ምስጉን : ነው : በክፉዎች : ምክር : ያልሄደ፥ በኃጢአተኞችም : መንገድ : ያልቆመ፥ በዋዘኞችም : ወንበር : ያልተቀመጠ።
2 ነገር ግን በእግዚአብሔር ሕግ ደስ ይለዋል፥ ሕጉንም በቀንና በሌሊት ያስባል።
3 እርሱም በውኃ ፈሳሾች ዳር እንደ ተተከለች፥ ፍሬዋን በየጊዜዋ እንደምትሰጥ፥ ቅጠልዋም እንደማይረግፍ ዛፍ ይሆናል፤ የሚሠራውም ሁሉ ይከናወንለታል።
4 ክፉዎች እንዲህ አይደሉም፥ ነገር ግን ነፋስ ጠርጎ እንደሚወስደው ትቢያ ናቸው።
5 ስለዚህ ክፉዎች በፍርድ፥ ኃጢአተኞችም በጻድቃን ማኅበር አይቆሙም።
6 እግዚአብሔር የጻድቃንን መንገድ ያውቃልና፥ የክፉዎች መንገድ ግን ትጠፋለች።
""",
    },
    {
      "id": 2,
      "ምዕራፍ": "ምዕራፍ 2",
      "text": """
1 አሕዛብ ለምን ያጕረመርማሉ? ወገኖችስ ለምን ከንቱን ይናገራሉ?
2 የምድር ነገሥታት ተነሡ፥ አለቆችም በእግዚአብሔርና በመሢሑ ላይ እንዲህ ሲሉ ተማከሩ።
3 ማሰርያቸውን እንበጥስ፥ ገመዳቸውንም ከእኛ እንጣል።
4 በሰማይ የሚኖር እርሱ ይሥቃል፥ ጌታም ይሣለቅባቸዋል።
5 በዚያን ጊዜ በቍጣው ይናገራቸዋል፥ በመዓቱም ያውካቸዋል።
6 እኔ ግን ንጉሤን ሾምሁ በተቀደሰው ተራራዬ በጽዮን ላይ።
7 ትእዛዙን እናገራለሁ፤ እግዚአብሔር አለኝ። አንተ ልጄ ነህ፥ እኔ ዛሬ ወለድሁህ።
8 ለምነኝ፥ አሕዛብን ለርስትህ የምድርንም ዳርቻ ለግዛትህ እሰጥሃለሁ።
9 በብረት በትር ትጠብቃቸዋለህ፥ እንደ ሸክላ ሠሪ ዕቃዎች ትቀጠቅጣቸዋለህ።
10 አሁንም እናንት ነገሥታት፥ ልብ አድርጉ፤ እናንት የምድር ፈራጆችም፥ ተገሠጹ።
11 ለእግዚአብሔር በፍርሃት ተገዙ፥ በረዓድም ደስ ይበላችሁ።
12 ተግሣጹን ተቀበሉ ጌታ እንዳይቈጣ እናንተም በመንገድ እንዳትጠፉ፥ ቍጣው ፈጥና ትነድዳለችና። በእርሱ የታመኑ ሁሉ የተመሰገኑ ናቸው።
""",
    },
    {
      "id": 3,
      "ምዕራፍ": "ምዕራፍ 3",
      "text": """
1 አቤቱ፥ የሚያስጨንቁኝ ምንኛ በዙ! በኔ ላይ የሚቆሙት ብዙ ናቸው።
2 ብዙ ሰዎች ነፍሴን። አምላክሽ አያድንሽም አልዋት።
3 አንተ ግን አቤቱ፥ መጠጊያዬ ነህ፥ ክብሬንና ራሴንም ከፍ ከፍ የምታደርገው አንተ ነህ።
4 በቃሌ ወደ እግዚአብሔር እጮሃለሁ ከተቀደሰ ተራራውም ይሰማኛል።
5 እኔ ተኛሁ አንቀላፋሁም፤ እግዚአብሔርም ደግፎኛልና ነቃሁ።
6 ከሚከብቡኝ ከአእላፍ ሕዝብ አልፈራም።
7 ተነሥ፥ አቤቱ፤ አምላኬ ሆይ፥ አድነኝ፤ አንተ የጠላቶቼን መንጋጋ መትተሃልና፥ የክፉዎችንም ጥርስ ሰብረሃልና።
8 ማዳን የእግዚአብሔር ነው፥ በረከትህም በሕዝብህ ላይ ነው።
""",
    },
    {
      "id": 4,
      "ምዕራፍ": "ምዕራፍ 4",
      "text": """
1 የጽድቄ አምላክ በጠራሁት ጊዜ መለሰልኝ፥ በጭንቀቴም አሰፋህልኝ፤ ማረኝ፥ ጸሎቴንም ስማ።
2 እናንት የሰው ልጆች፥ እስከ መቼ ድረስ ልባችሁን ታከብዳላችሁ?
3 እግዚአብሔር በጻድቁ እንደ ተገለጠ እወቁ፤ እግዚአብሔር ወደ እርሱ በተጣራሁ ጊዜ ይሰማኛል።
4 ተቈጡ፥ ነገር ግን ኃጢአትን አታድርጉ፤ በመኝታችሁ ሳላችሁ በልባችሁ አስቡ፤ ዝም በሉ።
5 የጽድቅን መሥዋዕት ሠዉ፥ በእግዚአብሔርም ታመኑ።
6 በጎውን ማን ያሳየናል? የሚሉ ብዙ ናቸው። አቤቱ፥ የፊትህ ብርሃን በላያችን ታወቀ።
7 በልቤ ደስታን ጨመርህ፤ ከስንዴ ፍሬና ከወይን ከዘይትም ይልቅ በዛ።
8 በሰላም እተኛለሁ አንቀላፋለሁም፤ አቤቱ፥ አንተ ብቻህን በእምነት አሳድረኸኛልና።
""",
    },

    {
      "id": 5,
      "ምዕራፍ": "ምዕራፍ 5",
      "text": """
1 አቤቱ፥ ቃሌን አድምጥ፥ ጩኸቴንም አስተውል፤
2 የልመናዬን ቃል አድምጥ፥ ንጉሤና አምላኬ ሆይ፥ አቤቱ፥ ወደ አንተ እጸልያለሁና።
3 በማለዳ ድምፄን ትሰማለህ፥ በማለዳ በፊትህ እቆማለሁ፥ እጠብቃለሁም።
4 አንተ በደልን የማትወድድ አምላክ ነህና፤ ክፉ ከአንተ ጋር አያድርም።
5 በከንቱ የሚመኩ በዓይኖችህ ፊት አይኖሩም፤ ክፉ አድራጊዎችን ሁሉ ጠላህ።
6 ሐሰትን የሚናገሩትን ታጠፋቸዋለህ፤ ደም አፍሳሹንና ሸንጋዩን ሰው እግዚአብሔር ይጸየፋል።
7 እኔ ግን በምሕረትህ ብዛት ወደ ቤትህ እገባለሁ፤ አንተን በመፍራት ወደ ቅድስናህ መቅደስ እሰግዳለሁ።
8 አቤቱ፥ ስለ ጠላቶቼ በጽድቅህ ምራኝ፤ መንገዴን በፊትህ አቅና።
9 በአፋቸው እውነት የለምና፥ ልባቸውም ከንቱ ነው፤ ጕሮሮአቸው የተከፈተ መቃብር ነው፤ በምላሳቸው ይሸነግላሉ።
10 አቤቱ፥ ፍረድባቸው፥ በምክራቸውም ይውደቁ፤ ስለ ክፋታቸውም ብዛት አሳድዳቸው፥ እነርሱ ዐምፀውብሃልና።
11 በአንተ የሚታመኑት ሁሉ ግን ደስ ይላቸዋል፤ ለዘላለሙ ደስ ይላቸዋል፥ እነርሱንም ትጠብቃለህ፤ ስምህንም የሚወድዱ ሁሉ በአንተ ይመካሉ።
12 አንተ ጻድቁን ትባርከዋለህና፤ አቤቱ፥ እንደ ጋሻ በሞገስ ከለልኸን።
""",
    },
    {
      "id": 6,
      "ምዕራፍ": "ምዕራፍ 6",
      "text": """
ለመዘምራን አለቃ በበገናዎች ስለ ስምንተኛ፤ የዳዊት መዝሙር።
1 አቤቱ፥ በቍጣህ አትቅሠፈኝ፥ በመዓትህም አትገሥጸኝ።
2 ድውይ ነኝና አቤቱ፥ ማረኝ፤ አጥንቶቼ ታውከዋልና ፈውሰኝ።
3 ነፍሴም እጅግ ታወከች፤ አንተም አቤቱ፥ እስከ መቼ ድረስ ነው?
4 አቤቱ፥ ተመለስ ነፍሴንም አድናት፥ ስለ ቸርነትህም አድነኝ።
5 በሞት የሚያስብህ የለምና፥ በሲኦልም የሚያመሰግንህ ማን ነው?
6 በጭንቀቴ ደክሜያለሁ፤ ሌሊቱን ሁሉ አልጋዬን አጥባለሁ፥ በዕንባዬም መኝታዬን አርሳለሁ።
7 ዓይኔ ከቍጡ ዕንባ የተነሣ ታወከች፤ ከጠላቶቼ ሁሉ የተነሣ አረጀሁ።
8 ዓመፃን የምታደርጉ ሁሉ፥ ከእኔ ራቁ፥ እግዚአብሔር የልቅሶዬን ቃል ሰምቶአልና።
9 እግዚአብሔር ልመናዬን ሰማኝ፤ እግዚአብሔር ጸሎቴን ተቀበለ።
10 ጠላቶቼ ሁሉ ይፈሩ እጅግም ይጐስቍሉ፤ ወደ ኋላቸው ይመለሱ፥ በፍጥነትም ይፈሩ።
""",
    },
    {
      "id": 7,
      "ምዕራፍ": "ምዕራፍ 7",
      "text": """
1 አቤቱ አምላኬ፥ በአንተ ታመንሁ፤ ከሚያሳድዱኝ ሁሉ አድነኝና አውጣኝ፥
2 ነፍሴን እንደ አንበሳ ነጥቀው እንዳይሰብሩዋት፥ የሚያድንና የሚታደግ ሳይኖር።
3 አቤቱ አምላኬ፥ እንዲህስ ካደረግሁ፥ ዓመፃም በእጄ ቢኖር፥
4 ክፉ ላደረጉብኝም ክፉን መልሼላቸው ብሆን፥ ጠላቴንም በከንቱ ገፍቼው ብሆን፥
5 ጠላት ነፍሴን ያሳድዳት ያግኛትም፥ ሕይወቴንም በምድር ላይ ይርገጣት፥ ክብሬንም በትቢያ ላይ ያዋርዳት።
6 አቤቱ፥ በመዓትህ ተነሥ፥ በጠላቶቼ ላይ በቍጣ ተነሣባቸው፤ አቤቱ አምላኬ፥ ባዘዝኸው ትእዛዝ ንቃ።
7 የአሕዛብም ጉባኤ ይከብብሃል፥ በእነርሱም ላይ ወደ ከፍታ ተመለስ።
8 እግዚአብሔር በአሕዛብ ይፈርዳል፤ አቤቱ፥ እንደ ጽድቄ ፍረድልኝ፥ እንደ የዋህነቴም ይሁንልኝ።
9 የኃጥኣን ክፋት ይጥፋ፥ ጻድቁን ግን አቅና፤ እግዚአብሔር ልቡናንና ኵላሊትን ይመረምራል።
10 እግዚአብሔር የጽድቅ ጋሻዬ ነው ልበ ቅኖችን የሚያድናቸው።
11 እግዚአብሔር የእውነት ዳኛ ነው፥ ኃይለኛም ታጋሽም ነው፥ ሁልጊዜም አይቈጣም።
12 ባትመለሱ ግን ሰይፉን ይስላል፥ ቀስቱን ገተረ አዘጋጀም፤
13 የሞት መሣርያንም አዘጋጀበት፥ ፍላጻዎቹንም የሚቃጠሉ አደረገ።
14 እነሆ፥ በዓመፃ ተጨነቀ ጉዳትን ፀነሰ ኃጢአትንም ወለደ።
15 ጕድጓድን ማሰ ቈፈረም። ባደረገውም ጕድጓድ ይወድቃል።
16 ጉዳቱ በራሱ ይመለሳል፥ ዓመፃውም በአናቱ ላይ ትወርዳለች።
17 እግዚአብሔርን እንደ ጽድቁ መጠን አመሰግናለሁ፥ ለልዑል እግዚአብሔርም ስም እዘምራለሁ።
""",
    },
    {
      "id": 8,
      "ምዕራፍ": "ምዕራፍ 8",
      "text": """
1 አቤቱ ጌታችን፥ ስምህ በምድር ሁሉ እጅግ ተመሰገነ፥ ምስጋናህ በሰማዮች ላይ ከፍ ከፍ ብሎአልና።
2 ከሕፃናትና ከሚጠቡ ልጆች አፍ ምስጋናን አዘጋጀህ ስለ ጠላትህ፥ ጠላትንና ቂመኛን ለማጥፋት።
3 የጣቶችህን ሥራ ሰማዮችን ባየሁ ጊዜ፥ ጨረቃንና ከዋክብትን አንተ የሠራሃቸውን፥
4 ታስበው ዘንድ ሰው ምንድር ነው? ትጐበኘውም ዘንድ የሰው ልጅ ምንድር ነው?
5 ከመላእክት እጅግ ጥቂት አሳነስኸው፤ በክብርና በምስጋና ዘውድ ከለልኸው።
6 በእጆችህም ሥራ ሁሉ ላይ ሾምኸው፤ ሁሉን ከእግሮቹ በታች አስገዛህለት፥
7 በጎችንም ላሞችንም ሁሉ ደግሞም የምድረ በዳውን እንስሶች፥
8 የሰማይንም ወፎች የባሕርንም ዓሦች፥ በባሕር መንገድ የሚሄደውንም ሁሉ።
9 አቤቱ ጌታችን፥ ስምህ በምድር ሁሉ እጅግ ተመሰገነ።
""",
    },
    {
      "id": 9,
      "ምዕራፍ": "ምዕራፍ 9",
      "text": """
ለመዘምራን አለቃ፤ በሙትላቤን፤ የዳዊት መዝሙር።
1.አቤቱ፥ በልቤ ሁሉ አመሰግንሃለሁ፥ ተአምራትህንም ሁሉ እነግራለሁ።
2 በአንተ ደስ ይለኛል፥ ሐሤትንም አደርጋለሁ፤ ልዑል ሆይ፥ ለስምህ እዘምራለሁ።
3 ጠላቶቼ ወደ ኋላ በተመለሱ ጊዜ፥ ይሰናከላሉ ከፊትህም ይጠፋሉ።
4 ፍርዴንና በቀሌን አድርገህልኛልና፤ ጽድቅን እየፈረድህ በዙፋንህ ላይ ተቀመጥህ።
5 አሕዛብን ገሠጽህ፥ ዝንጉዎችንም አጠፋህ፥ ስማቸውንም ለዘላለም ደመሰስህ።
6 ጠላቶች በጦር ለዘላለም ጠፉ፥ ከተሞቻቸውንም አፈረስህ፥ ዝክራቸውም በአንድነት ጠፋ።
7 እግዚአብሔር ግን ለዘላለም ይኖራል፥ ዙፋኑንም ለመፍረድ አዘጋጀ፤
8 እርሱም ዓለምን በጽድቅ ይፈርዳታል፥ አሕዛብንም በቅንነት ይዳኛቸዋል።
9 እግዚአብሔርም ለድሆች መጠጊያ ሆናቸው፥ እርሱም በመከራቸው ጊዜ ረዳታቸው ነው።
10 ስምህን የሚያውቁ ሁሉ በአንተ ይታመናሉ፥ አቤቱ፥ የሚሹህን አትተዋቸውምና።
11 በጽዮን ለሚኖር ለእግዚአብሔር ዘምሩ፥ በአሕዛብም መካከል አደራረጉን ንገሩ፤
12 ደማቸውን የሚመራመር እርሱ አስቦአልና፥ የድሆችንም ጩኸት አልረሳምና።
13 አቤቱ፥ እዘንልኝ፥ ጠላቶቼም የሚያመጡብኝን መከራ እይ፥ ከሞት ደጆች ከፍ ከፍ የምታደርገኝ፤
14 ምስጋናውን ሁሉ እናገር ዘንድ፤ በጽዮን ልጅ በደጆችዋ በማዳንህ ደስ ይለኛል።
15 አሕዛብ በሠሩት ጕድጓድ ወደቁ፥ በዚያችም በሸሸጓት ወጥመድ እግራቸው ተጠመደች።
16 እግዚአብሔር ፍርድን በማድረግ የታወቀ ነው፤ ኃጢአተኛው በእጆቹ ሥራ ተጠመደ።
17 ኃጢአተኞች ወደ ሲኦል ይመለሳሉ፥ እግዚአብሔርን የሚረሱ አሕዛብም ሁሉ።
18 ድሀ ለዘላለም አይረሳምና፥ የችግረኞችም ተስፋቸው ለዘላለም አይጠፋም።
19 አቤቱ፥ ተነሥ፤ ሰውም አይበርታ፥ አሕዛብም በፊትህ ይፈረድባቸው።
20 አቤቱ፥ ፍርሃትን በላያቸው ጫንባቸው፤ አሕዛብ ሰዎች እንደ ሆኑ ይወቁ።
""",
    },
    {
      "id": 10,
      "ምዕራፍ": "ምዕራፍ 10",
      "text": """
1 አቤቱ፥ ለምን ርቀህ ቆምህ? በመከራም ጊዜ ለምን ትሰወራለህ?
2 በኃጢአተኛ ትዕቢት ድሀ ይናደዳል፤ ባሰቡት ተንኰላቸው ተጠመዱ።
3 ኃጢአተኛ በነፍሱ ፈቃድ ይወደሳልና፥ ዓመፀኛም ይባርካል።
4 ኃጢአተኛ እግዚአብሔርን አበሳጨው፥ እንደ ቍጣውም ብዛት አይመራመረውም በእርሱ ፊት እግዚአብሔር የለም።
5 መንገዱ ሁሉ የረከሰ ነው፥ ፍርድህም በፊቱ የፈረሰ ነው፥ ጠላቶችንም ሁሉ ይገዛቸዋል።
6 በልቡ ይላል። ለልጅ ልጅ አልታወክም ክፉም አያገኘኝም።
7 አፉ መርገምንና ሽንገላን ተንኰልን የተመላ ነው፤ ከምላሱ በታች ጉዳትና መከራ ነው።
8 በመንደሮች መሸመቅያ ይቀመጣል ንጹሓንን በስውር ይገድል ዘንድ፤ ዓይኖቹም ወደ ድኃ ይመለከታሉ።
9 እንደ አንበሳ በችፍግ ዱር በስውር ይሸምቃል፤ ድሀውን ለመንጠቅ ያደባል፤ ድሀውን ይነጥቀዋል በአሽክላውም ይስበዋል።
10 ድሀ ይዋረዳል፥ ይጐብጣል፤ በኃያላኑም እጅግ ይወድቃል።
11 በልቡም ይላል። እግዚአብሔር ረስቶኛል፤ ፈጽሞም እንዳያይ ፊቱን ሰወረ።
12 አቤቱ አምላክ ሆይ፥ ተነሥ እጅህም ከፍ ከፍ ትበል፤ ድሆችን አትርሳ።
13 ኃጢአተኛ ስለ ምን እግዚአብሔርን አስቈጣው? በልቡ። አይመራመረኝም ይላልና።
14 አየኸው፥ አንተ ክፋትንና ቍጣን ትመለከታለህና በእጅህ ፍዳውን ለመስጠት፤ ድሀ ራሱን ለአንተ ይተዋል፥ ለድሀ አደግም ረዳቱ አንተ ነህ።
15 የኃጢአተኛንና የክፉን ክንድ ስበር፥ የኃጢአቱንም ብድራት ክፈል ሌላ እስከማይገኝ ድረስ።
16 እግዚአብሔር ለዘላለም ይነግሣል፤ አሕዛብ ከምድሩ ይጠፋሉ።
17 እግዚአብሔር የድሆችን ምኞት ሰማ፥ ጆሮውም የልባቸውን አሳብ አደመጠች፥
18 ፍርዱ ለድሀ አደግና ለችግረኛ ይደረግ ዘንድ፥ ሰዎች በምድር ላይ አፋቸውን ከፍ ከፍ ማድረግ እንዳይደግሙ""",
    },
    {
      "id": 11,
      "ምዕራፍ": "ምዕራፍ 11",
      "text": """
ለመዘምራን አለቃ፤ የዳዊት መዝሙር።
1 በእግዚአብሔር ታመንሁ፤ ነፍሴን። እንደ ወፍ ወደ ተራሮች ተቅበዝበዢ እንዴት ትሉአታላችሁ?
2 ኃጢአተኞች እነሆ ቀስታቸውን ገትረዋልና፥ ፍላጻቸውንም በአውታር አዘጋጅተዋልና፥ ልበ ቅኖችን በስውር ይነድፉ ዘንድ።
3 አንተ የሠራኸውን እነሆ እነርሱ አፍርሰዋልና፤ ጻድቅ ግን ምን አደረገ?
4 እግዚአብሔር በተቀደሰው መቅደሱ ነው፤ እግዚአብሔር፥ ዙፋኑ በሰማይ ነው፤ ዓይኖቹ ወደ ድሃ ይመለከታሉ፥ ቅንድቦቹም የሰው ልጆችን ይመረምራሉ።
5 እግዚአብሔር ጻድቅንና ኅጥእን ይመረምራል፤ ዓመፃን የወደዳት ግን ነፍሱን ጠልቶአል።
6 ወጥመድ በኅጥኣን ላይ ያዘንባል እሳትና ዲን ዐውሎ ነፋስም የጽዋቸው እድል ፈንታ ነው።
7 እግዚአብሔር ጻድቅ ነውና፥ ጽድቅንም ይወድዳል፤ ቅንነት ግን ፊቱን ታየዋለች።
""",
    },
    {
      "id": 12,
      "ምዕራፍ": "ምዕራፍ 12",
      "text": """
ለመዘምራን አለቃ፥ ስለ ስምንተኛ የዳዊት መዝሙር።
1 አቤቱ፥ አድነኝ፤ ደግ ሰው አልቆአልና፥ ከሰው ልጆችም መተማመን ጐድሎአልና።
2 እርስ በርሳቸው ከንቱ ነገርን ይናገራሉ፤ በሽንገላ ከንፈር ሁለት ልብ ሆነው ይናገራሉ።
3 የሽንገላን ከንፈሮች ሁሉ እግዚአብሔር ያጠፋቸዋል፥ ታላቅ ነገርን የምትናገረውን ምላስ፤
4 ምላሳችንን እናበረታለን፤ ከንፈራችን የእኛ ነው፥ ጌታችን ማን ነው? የሚሉትን።
5 ስለ ድሆች መከራ፥ ስለ ችግረኞች ጩኸት እግዚአብሔር። አሁን እነሣለሁ ይላል፤ መድኃኒትን አደርጋለሁ፥ በላዩም እገልጣለሁ።
6 በምድር ላይ እንደ ተፈተነ ሰባት ጊዜ እንደ ተጣራ ብር። የእግዚአብሔር ቃላት የነጹ ቃላት ናቸው።
7 አቤቱ፥ አንተ ጠብቀን፥ ከዚህችም ትውልድ ለዘላለም ታደገን።
8 በሰው ልጆች ዘንድ ምናምንቴ ከፍ ከፍ ባለ ጊዜ ክፉዎች በዙሪያው ሁሉ ይመላለሳሉ።
""",
    },
    {
      "id": 13,
      "ምዕራፍ": "ምዕራፍ 13",
      "text": """



""",
    },
    {
      "id": 14,
      "ምዕራፍ": "ምዕራፍ 15",
      "text": """



""",
    },
    {
      "id": 15,
      "ምዕራፍ": "ምዕራፍ 16",
      "text": """



""",
    },
    {
      "id": 17,
      "ምዕራፍ": "ምዕራፍ 17",
      "text": """



""",
    },
    {
      "id": 18,
      "ምዕራፍ": "ምዕራፍ 18",
      "text": """



""",
    },
    {
      "id": 19,
      "ምዕራፍ": "ምዕራፍ 19",
      "text": """



""",
    },
    {
      "id": 20,
      "ምዕራፍ": "ምዕራፍ 20",
      "text": """



""",
    },
  ];

  // ...existing code...

  @override
  void initState() {
    super.initState();

    _initPrefs();
  }

  Future<void> _initPrefs() async {
    final SharedPreferences prefs = await SharedPreferences.getInstance();

    if (widget.fontTypes != null && widget.fontTypes!.isNotEmpty) {
      await prefs.setString('font_key', '${widget.fontTypes}');
    }

    final String stored = prefs.getString('font_key') ?? '';

    setState(() {
      displayFont = stored;
    });
  }

  @override
  Widget build(BuildContext context) {
    return ListView.builder(
      scrollDirection: widget.bodyBool,
      itemCount: mezmureDawit.length,

      shrinkWrap: true,

      itemBuilder: (context, index) {
        return Column(
          children: [
            Container(
              padding: EdgeInsets.only(top: 5.0),
              child: Padding(
                padding: const EdgeInsets.only(right: 20.0, bottom: 10.0),
                child: Align(
                  alignment: AlignmentGeometry.bottomRight,
                  child: Text(
                    style: TextStyle(
                      fontSize: 25.0,
                      fontWeight: FontWeight.bold,
                      wordSpacing: 10.0,
                      fontFamily: '$displayFont',
                    ),
                    mezmureDawit[index]['ምዕራፍ'],
                  ),
                ),
              ),
            ),
            Container(
              padding: EdgeInsets.only(right: 15.0),
              child: Divider(indent: 100.0, color: Colors.deepOrange),
            ),
            Padding(
              padding: const EdgeInsets.all(15.0),
              child: Text(
                style: TextStyle(
                  fontSize: 20.0,
                  wordSpacing: 2.0,
                  fontFamily: '$displayFont',
                ),
                mezmureDawit[index]['text'],
              ),
            ),
          ],
        );
      },
    );
  }
}
